Sets format Options
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public void SetFormatOptions(
	FormatOptions formatOptions
)
  Visual Basic
Public Sub SetFormatOptions ( _
	formatOptions As FormatOptions _
)
  Visual C++
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
 Parameters
  formatOptions
 Type:  Autodesk.Revit.DB FormatOptions
 format options to be set
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  DimensionEqualityLabelFormatting Class
  Autodesk.Revit.DB Namespace